Revit 2027 API
RebarSpliceByRulesRunOutPosition Enumeration
 Describes the run-out position.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarSpliceByRulesRunOutPosition
Public Enumeration RebarSpliceByRulesRunOutPosition
public enum class RebarSpliceByRulesRunOutPosition
type RebarSpliceByRulesRunOutPosition
Members
Member name | Value | Description
End | 1 |  The rest will remain at the end of the bar.
Start | 0 |  The rest will remain at the start of the bar.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace